"""
Домашнее задание (занятие 6)

1 Модуль.
- Перенесите ваши функции из прошлого домашнего задания в отдельный
файл и импортируйте их в основной (исполняемый) файл.
- Запустите каждую вашу функцию по 1 или более раз в исполняемом файле.

2Анонимная функция 🎭.

- Создайте анонимную функцию pow, которая принимает 2 аргумента x и y.
Функция должна возвращать x, возведенное в степень y.

3 Змея 🐍.

- Создайте функцию snake_talk, которая принимает 1 аргумент text (строка).
- Функция должна создать новую строку, где все гласные буквы
aeiouyAEIOUY в строке text дублируются.
- Например, такой вызовы функции snake_talk(“Harry”) должен вернуть
строку “Haaryy”.

Повторение прошлого материала.

Ответьте на следующие вопросы:
• Что такое изменяемый и неизменяемый объект?
• Как НЕЛЬЗЯ называть переменную?
• Зачем нужна строка документации в функции?
"""